trainning/101programming/codeStream_BC/fillBox_BC/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    leftWall
    {
   	type            codedFixedValue;
    	value           uniform (0 0 0);
    	redirectType    inletProfile1;

	code
    	#{
            const fvPatch& boundaryPatch = patch(); 
            const vectorField& Cf = boundaryPatch.Cf(); 
            vectorField& field = *this; 
        
            scalar minz = 0.4;  
            scalar maxz = 0.6; 
            scalar miny = 0.5;  
            scalar maxy = 0.7; 

	    	scalar t = this->db().time().value();

 	    	forAll(Cf, faceI)
            {
      		//if (Cf[faceI].y() <= 0.1)

                if (
                   (Cf[faceI].z() > minz) &&
                   (Cf[faceI].z() < maxz) &&
                   (Cf[faceI].y() > miny) &&
                   (Cf[faceI].y() < maxy) 
                   )
            	   {
		       if ( t < 1.)
		       {
               		field[faceI] = vector(1,0,0);
		       }
		       else
		       {
		           field[faceI] = vector(0,0,0);
		       }

	    	       //field[faceI] = vector(1,0,0);
	           }
          
	    }
   	#};         

  	codeOptions
  	#{
       	    -I$(LIB_SRC)/finiteVolume/lnInclude \
       	    -I$(LIB_SRC)/meshTools/lnInclude
   	#};

  	codeInclude
   	#{
      	    #include "fvCFD.H"
      	    #include <cmath>
     	    #include <iostream>
	#};
    }

    rightWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    backWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
